pangfudong/i.mx53/mcu/ZY_CODE/Startup/lpc1100.h
/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:            LPC1100.H
** Last modified Date:   2009-05-12
** Last Version:         V1.01
** Descriptions:         lpc1100寄存器地址定义
**
**--------------------------------------------------------------------------------------------------------
** Created by:           Liangbaoqiong
** Created date:         2009-05-12
** Version:              V1.00
** Descriptions:         
**--------------------------------------------------------------------------------------------------------
** Modified by:          Lanwuqiang
** Modified date:        2009-10-21
** Version:              V1.01
** Descriptions:         定义LPC1100寄存器
*********************************************************************************************************/
#ifndef __IOLPC1100_H
#define __IOLPC1100_H

/*********************************************************************************************************
  NVIC嵌套向量中断控制器
*********************************************************************************************************/
#define NVIC                    (*(volatile unsigned long *)0xE000E004)
#define STCTRL                  (*(volatile unsigned long *)0xE000E010)
#define STRELOAD                (*(volatile unsigned long *)0xE000E014)
#define STCURR                  (*(volatile unsigned long *)0xE000E018)
#define STCALIB                 (*(volatile unsigned long *)0xE000E01C)
#define ISER                    (*(volatile unsigned long *)0xE000E100)
#define SETENA                  (*(volatile unsigned long *)0xE000E100)
#define ICER                    (*(volatile unsigned long *)0xE000E180)
#define CLRENA                  (*(volatile unsigned long *)0xE000E180)
#define ISPR                    (*(volatile unsigned long *)0xE000E200)
#define SETPEND                 (*(volatile unsigned long *)0xE000E200)
#define ICPR                    (*(volatile unsigned long *)0xE000E280)
#define CLRPEND                 (*(volatile unsigned long *)0xE000E280)
#define IP0                     (*(volatile unsigned long *)0xE000E400)
#define IP1                     (*(volatile unsigned long *)0xE000E404)
#define IP2                     (*(volatile unsigned long *)0xE000E408)
#define IP3                     (*(volatile unsigned long *)0xE000E40C)
#define IP4                     (*(volatile unsigned long *)0xE000E410)
#define IP5                     (*(volatile unsigned long *)0xE000E414)
#define IP6                     (*(volatile unsigned long *)0xE000E418)
#define IP7                     (*(volatile unsigned long *)0xE000E41C)

#define CPUIDBR                 (*(volatile unsigned long *)0xE000ED00)
#define ICSR                    (*(volatile unsigned long *)0xE000ED04)
#define VTOR                    (*(volatile unsigned long *)0xE000ED08)
#define AITCR                   (*(volatile unsigned long *)0xE000ED0C)
#define SCR                     (*(volatile unsigned long *)0xE000ED10)
#define CCR                     (*(volatile unsigned long *)0xE000ED14)
#define SHPR0                   (*(volatile unsigned long *)0xE000ED18)
#define SHPR1                   (*(volatile unsigned long *)0xE000ED1C)
#define SHPR2                   (*(volatile unsigned long *)0xE000ED20)
#define SHCSR                   (*(volatile unsigned long *)0xE000ED24)
#define CFSR                    (*(volatile unsigned long *)0xE000ED28)
#define HFSR                    (*(volatile unsigned long *)0xE000ED2C)
#define DFSR                    (*(volatile unsigned long *)0xE000ED30)
#define MMFAR                   (*(volatile unsigned long *)0xE000ED34)
#define BFAR                    (*(volatile unsigned long *)0xE000ED38)
#define STIR                    (*(volatile unsigned long *)0xE000EF00)

/*********************************************************************************************************
  Base addresses
*********************************************************************************************************/
#define FLASH_BASE              (0x00000000UL)
#define RAM_BASE                (0x10000000UL)
#define APB0_BASE               (0x40000000UL)
#define AHB_BASE                (0x50000000UL)

/*********************************************************************************************************
  I2C
*********************************************************************************************************/
#define I2C_BASE                (APB0_BASE + 0x00000)

#define I2CCONSET               (*(volatile unsigned long *)(I2C_BASE + 0x000))
#define I2CSTAT                 (*(volatile unsigned long *)(I2C_BASE + 0x004))
#define I2CDAT                  (*(volatile unsigned long *)(I2C_BASE + 0x008))
#define I2CADR0                 (*(volatile unsigned long *)(I2C_BASE + 0x00C))
#define I2CSCLH                 (*(volatile unsigned long *)(I2C_BASE + 0x010))
#define I2CSCLL                 (*(volatile unsigned long *)(I2C_BASE + 0x014))
#define I2CCONCLR               (*(volatile unsigned long *)(I2C_BASE + 0x018))
#define I2CMMCTRL               (*(volatile unsigned long *)(I2C_BASE + 0x01C))
#define I2CADR1                 (*(volatile unsigned long *)(I2C_BASE + 0x020))
#define I2CADR2                 (*(volatile unsigned long *)(I2C_BASE + 0x024))
#define I2CADR3                 (*(volatile unsigned long *)(I2C_BASE + 0x028))
#define I2CDATABUFFER           (*(volatile unsigned long *)(I2C_BASE + 0x02C))
#define I2CMASK0                (*(volatile unsigned long *)(I2C_BASE + 0x030))
#define I2CMASK1                (*(volatile unsigned long *)(I2C_BASE + 0x034))
#define I2CMASK2                (*(volatile unsigned long *)(I2C_BASE + 0x038))
#define I2CMASK3                (*(volatile unsigned long *)(I2C_BASE + 0x03C))

