pangfudong/i.mx53/mcu/ZY_CODE/Startup/lpc1100.h
/*********************************************************************************************************
  WatchDogTimer
*********************************************************************************************************/
#define WDT_BASE                (APB0_BASE + 0x04000)

#define WDTMOD                  (*(volatile unsigned long *)(WDT_BASE + 0x000))
#define WDTTC                   (*(volatile unsigned long *)(WDT_BASE + 0x004))
#define WDTFEED                 (*(volatile unsigned long *)(WDT_BASE + 0x008))
#define WDTTV                   (*(volatile unsigned long *)(WDT_BASE + 0x00C))

/*********************************************************************************************************
  UART
*********************************************************************************************************/
#define UART_BASE               (APB0_BASE + 0x08000)

#define U0RBR                   (*(volatile unsigned long *)(UART_BASE + 0x000))
#define U0THR                   (*(volatile unsigned long *)(UART_BASE + 0x000))
#define U0DLL                   (*(volatile unsigned long *)(UART_BASE + 0x000))
#define U0DLM                   (*(volatile unsigned long *)(UART_BASE + 0x004))
#define U0IER                   (*(volatile unsigned long *)(UART_BASE + 0x004))
#define U0IIR                   (*(volatile unsigned long *)(UART_BASE + 0x008))
#define U0FCR                   (*(volatile unsigned long *)(UART_BASE + 0x008))
#define U0LCR                   (*(volatile unsigned long *)(UART_BASE + 0x00C))
#define U0MCR                   (*(volatile unsigned long *)(UART_BASE + 0x010))
#define U0LSR                   (*(volatile unsigned long *)(UART_BASE + 0x014))
#define U0MSR                   (*(volatile unsigned long *)(UART_BASE + 0x018))
#define U0SCR                   (*(volatile unsigned long *)(UART_BASE + 0x01C))
#define U0ACR                   (*(volatile unsigned long *)(UART_BASE + 0x020))
#define U0FDR                   (*(volatile unsigned long *)(UART_BASE + 0x028))
#define U0TER                   (*(volatile unsigned long *)(UART_BASE + 0x030))
#define U0RS485CTRL             (*(volatile unsigned long *)(UART_BASE + 0x04C))
#define U0ADRMATCH              (*(volatile unsigned long *)(UART_BASE + 0x050))
#define U0RS485DLY              (*(volatile unsigned long *)(UART_BASE + 0x054))
#define U0FIFOLVL               (*(volatile unsigned long *)(UART_BASE + 0x058))

/*********************************************************************************************************
  16bit Counter/Timer 0
*********************************************************************************************************/
#define CT16B0_BASE             (APB0_BASE + 0x0C000)

#define TMR16B0IR               (*(volatile unsigned long *)(CT16B0_BASE + 0x000))
#define TMR16B0TCR              (*(volatile unsigned long *)(CT16B0_BASE + 0x004))
#define TMR16B0TC               (*(volatile unsigned long *)(CT16B0_BASE + 0x008))
#define TMR16B0PR               (*(volatile unsigned long *)(CT16B0_BASE + 0x00C))
#define TMR16B0PC               (*(volatile unsigned long *)(CT16B0_BASE + 0x010))
#define TMR16B0MCR              (*(volatile unsigned long *)(CT16B0_BASE + 0x014))
#define TMR16B0MR0              (*(volatile unsigned long *)(CT16B0_BASE + 0x018))
#define TMR16B0MR1              (*(volatile unsigned long *)(CT16B0_BASE + 0x01C))
#define TMR16B0MR2              (*(volatile unsigned long *)(CT16B0_BASE + 0x020))
#define TMR16B0MR3              (*(volatile unsigned long *)(CT16B0_BASE + 0x024))
#define TMR16B0CCR              (*(volatile unsigned long *)(CT16B0_BASE + 0x028))
#define TMR16B0CR0              (*(volatile unsigned long *)(CT16B0_BASE + 0x02C))
#define TMR16B0EMR              (*(volatile unsigned long *)(CT16B0_BASE + 0x03C))
#define TMR16B0CTCR             (*(volatile unsigned long *)(CT16B0_BASE + 0x070))
#define TMR16B0PWMC             (*(volatile unsigned long *)(CT16B0_BASE + 0x074))

/*********************************************************************************************************
  16 BIT  Counter/Timer 1
*********************************************************************************************************/
#define CT16B1_BASE             (APB0_BASE + 0x10000)

#define TMR16B1IR               (*(volatile unsigned long *)(CT16B1_BASE + 0x000))
#define TMR16B1TCR              (*(volatile unsigned long *)(CT16B1_BASE + 0x004))
#define TMR16B1TC               (*(volatile unsigned long *)(CT16B1_BASE + 0x008))
#define TMR16B1PR               (*(volatile unsigned long *)(CT16B1_BASE + 0x00C))
#define TMR16B1PC               (*(volatile unsigned long *)(CT16B1_BASE + 0x010))
#define TMR16B1MCR              (*(volatile unsigned long *)(CT16B1_BASE + 0x014))
#define TMR16B1MR0              (*(volatile unsigned long *)(CT16B1_BASE + 0x018))
#define TMR16B1MR1              (*(volatile unsigned long *)(CT16B1_BASE + 0x01C))
#define TMR16B1MR2              (*(volatile unsigned long *)(CT16B1_BASE + 0x020))
#define TMR16B1MR3              (*(volatile unsigned long *)(CT16B1_BASE + 0x024))
#define TMR16B1CCR              (*(volatile unsigned long *)(CT16B1_BASE + 0x028))
#define TMR16B1CR0              (*(volatile unsigned long *)(CT16B1_BASE + 0x02C))
#define TMR16B1EMR              (*(volatile unsigned long *)(CT16B1_BASE + 0x03C))
#define TMR16B1CTCR             (*(volatile unsigned long *)(CT16B1_BASE + 0x070))
#define TMR16B1PWMC             (*(volatile unsigned long *)(CT16B1_BASE + 0x074))

/*********************************************************************************************************
  32 bit Counter/Timer 0
*********************************************************************************************************/
#define CT32B0_BASE             (APB0_BASE + 0x14000)

#define TMR32B0IR               (*(volatile unsigned long *)(CT32B0_BASE + 0x000))
#define TMR32B0TCR              (*(volatile unsigned long *)(CT32B0_BASE + 0x004))
#define TMR32B0TC               (*(volatile unsigned long *)(CT32B0_BASE + 0x008))
#define TMR32B0PR               (*(volatile unsigned long *)(CT32B0_BASE + 0x00C))
#define TMR32B0PC               (*(volatile unsigned long *)(CT32B0_BASE + 0x010))
#define TMR32B0MCR              (*(volatile unsigned long *)(CT32B0_BASE + 0x014))
#define TMR32B0MR0              (*(volatile unsigned long *)(CT32B0_BASE + 0x018))
#define TMR32B0MR1              (*(volatile unsigned long *)(CT32B0_BASE + 0x01C))
#define TMR32B0MR2              (*(volatile unsigned long *)(CT32B0_BASE + 0x020))
#define TMR32B0MR3              (*(volatile unsigned long *)(CT32B0_BASE + 0x024))
#define TMR32B0CCR              (*(volatile unsigned long *)(CT32B0_BASE + 0x028))
#define TMR32B0CR0              (*(volatile unsigned long *)(CT32B0_BASE + 0x02C))
#define TMR32B0EMR              (*(volatile unsigned long *)(CT32B0_BASE + 0x03C))
#define TMR32B0CTCR             (*(volatile unsigned long *)(CT32B0_BASE + 0x070))
#define TMR32B0PWMC             (*(volatile unsigned long *)(CT32B0_BASE + 0x074))

