pangfudong/i.mx53/mcu/ZY_CODE/Startup/lpc1100.h
/*********************************************************************************************************
  32 bit Counter/Timer 1
*********************************************************************************************************/
#define CT32B1_BASE             (APB0_BASE + 0x18000)

#define TMR32B1IR               (*(volatile unsigned long *)(CT32B1_BASE + 0x000))
#define TMR32B1TCR              (*(volatile unsigned long *)(CT32B1_BASE + 0x004))
#define TMR32B1TC               (*(volatile unsigned long *)(CT32B1_BASE + 0x008))
#define TMR32B1PR               (*(volatile unsigned long *)(CT32B1_BASE + 0x00C))
#define TMR32B1PC               (*(volatile unsigned long *)(CT32B1_BASE + 0x010))
#define TMR32B1MCR              (*(volatile unsigned long *)(CT32B1_BASE + 0x014))
#define TMR32B1MR0              (*(volatile unsigned long *)(CT32B1_BASE + 0x018))
#define TMR32B1MR1              (*(volatile unsigned long *)(CT32B1_BASE + 0x01C))
#define TMR32B1MR2              (*(volatile unsigned long *)(CT32B1_BASE + 0x020))
#define TMR32B1MR3              (*(volatile unsigned long *)(CT32B1_BASE + 0x024))
#define TMR32B1CCR              (*(volatile unsigned long *)(CT32B1_BASE + 0x028))
#define TMR32B1CR0              (*(volatile unsigned long *)(CT32B1_BASE + 0x02C))
#define TMR32B1EMR              (*(volatile unsigned long *)(CT32B1_BASE + 0x03C))
#define TMR32B1CTCR             (*(volatile unsigned long *)(CT32B1_BASE + 0x070))
#define TMR32B1PWMC             (*(volatile unsigned long *)(CT32B1_BASE + 0x074))

/*********************************************************************************************************
  ADC
**********************************************************************************************************/
#define ADC_BASE                (APB0_BASE + 0x1C000)

#define AD0CR                   (*(volatile unsigned long *)(ADC_BASE + 0x000))
#define AD0GDR                  (*(volatile unsigned long *)(ADC_BASE + 0x004))
#define AD0INTEN                (*(volatile unsigned long *)(ADC_BASE + 0x00C))
#define AD0DR0                  (*(volatile unsigned long *)(ADC_BASE + 0x010))
#define AD0DR1                  (*(volatile unsigned long *)(ADC_BASE + 0x014))
#define AD0DR2                  (*(volatile unsigned long *)(ADC_BASE + 0x018))
#define AD0DR3                  (*(volatile unsigned long *)(ADC_BASE + 0x01C))
#define AD0DR4                  (*(volatile unsigned long *)(ADC_BASE + 0x020))
#define AD0DR5                  (*(volatile unsigned long *)(ADC_BASE + 0x024))
#define AD0DR6                  (*(volatile unsigned long *)(ADC_BASE + 0x028))
#define AD0DR7                  (*(volatile unsigned long *)(ADC_BASE + 0x02C))
#define AD0STAT                 (*(volatile unsigned long *)(ADC_BASE + 0x030))

/*********************************************************************************************************
  power management unit (PMU)
*********************************************************************************************************/
#define PMU_BASE                (APB0_BASE + 0x38000)

#define PCON                    (*(volatile unsigned long *)(PMU_BASE + 0x000))
#define GPREG0                  (*(volatile unsigned long *)(PMU_BASE + 0x004))
#define GPREG1                  (*(volatile unsigned long *)(PMU_BASE + 0x008))
#define GPREG2                  (*(volatile unsigned long *)(PMU_BASE + 0x00C))
#define GPREG3                  (*(volatile unsigned long *)(PMU_BASE + 0x010))
#define GPREG4                  (*(volatile unsigned long *)(PMU_BASE + 0x014))

/*********************************************************************************************************
  Synchronous Serial Communication (SSP0)
*********************************************************************************************************/
#define SSP0_BASE               (APB0_BASE + 0x40000)

#define SSP0CR0                 (*(volatile unsigned long *)(SSP0_BASE + 0x000))
#define SSP0CR1                 (*(volatile unsigned long *)(SSP0_BASE + 0x004))
#define SSP0DR                  (*(volatile unsigned long *)(SSP0_BASE + 0x008))
#define SSP0SR                  (*(volatile unsigned long *)(SSP0_BASE + 0x00C))
#define SSP0CPSR                (*(volatile unsigned long *)(SSP0_BASE + 0x010))
#define SSP0IMSC                (*(volatile unsigned long *)(SSP0_BASE + 0x014))
#define SSP0RIS                 (*(volatile unsigned long *)(SSP0_BASE + 0x018))
#define SSP0MIS                 (*(volatile unsigned long *)(SSP0_BASE + 0x01C))
#define SSP0ICR                 (*(volatile unsigned long *)(SSP0_BASE + 0x020))

/*********************************************************************************************************
  Synchronous Serial Communication (SSP1) 仅LQFP48和PLCC44封装具有
*********************************************************************************************************/
#define SSP1_BASE               (APB0_BASE + 0x58000)

#define SSP1CR0                 (*(volatile unsigned long *)(SSP1_BASE + 0x000))
#define SSP1CR1                 (*(volatile unsigned long *)(SSP1_BASE + 0x004))
#define SSP1DR                  (*(volatile unsigned long *)(SSP1_BASE + 0x008))
#define SSP1SR                  (*(volatile unsigned long *)(SSP1_BASE + 0x00C))
#define SSP1CPSR                (*(volatile unsigned long *)(SSP1_BASE + 0x010))
#define SSP1IMSC                (*(volatile unsigned long *)(SSP1_BASE + 0x014))
#define SSP1RIS                 (*(volatile unsigned long *)(SSP1_BASE + 0x018))
#define SSP1MIS                 (*(volatile unsigned long *)(SSP1_BASE + 0x01C))
#define SSP1ICR                 (*(volatile unsigned long *)(SSP1_BASE + 0x020))

/*********************************************************************************************************
  IO Configuration Block
*********************************************************************************************************/
#define IOCON_BASE              (APB0_BASE + 0x44000)

#define IOCON_PIO2_6            (*(volatile unsigned long *)(IOCON_BASE + 0x000))
#define IOCON_PIO2_0            (*(volatile unsigned long *)(IOCON_BASE + 0x008))
#define IOCON_RESET_PIO0_0      (*(volatile unsigned long *)(IOCON_BASE + 0x00C))
#define IOCON_PIO0_1            (*(volatile unsigned long *)(IOCON_BASE + 0x010))
#define IOCON_PIO1_8            (*(volatile unsigned long *)(IOCON_BASE + 0x014))
#define IOCON_PIO0_2            (*(volatile unsigned long *)(IOCON_BASE + 0x01C))
#define IOCON_PIO2_7            (*(volatile unsigned long *)(IOCON_BASE + 0x020))
#define IOCON_PIO2_8            (*(volatile unsigned long *)(IOCON_BASE + 0x024))
#define IOCON_PIO2_1            (*(volatile unsigned long *)(IOCON_BASE + 0x028))
#define IOCON_PIO0_3            (*(volatile unsigned long *)(IOCON_BASE + 0x02C))
#define IOCON_PIO0_4            (*(volatile unsigned long *)(IOCON_BASE + 0x030))
#define IOCON_PIO0_5            (*(volatile unsigned long *)(IOCON_BASE + 0x034))
#define IOCON_PIO1_9            (*(volatile unsigned long *)(IOCON_BASE + 0x038))
#define IOCON_PIO3_4            (*(volatile unsigned long *)(IOCON_BASE + 0x03C))
#define IOCON_PIO2_4            (*(volatile unsigned long *)(IOCON_BASE + 0x040))

#define IOCON_PIO2_5            (*(volatile unsigned long *)(IOCON_BASE + 0x044))
#define IOCON_PIO3_5            (*(volatile unsigned long *)(IOCON_BASE + 0x048))
#define IOCON_PIO0_6            (*(volatile unsigned long *)(IOCON_BASE + 0x04C))
#define IOCON_PIO0_7            (*(volatile unsigned long *)(IOCON_BASE + 0x050))
#define IOCON_PIO2_9            (*(volatile unsigned long *)(IOCON_BASE + 0x054))
#define IOCON_PIO2_10           (*(volatile unsigned long *)(IOCON_BASE + 0x058))
#define IOCON_PIO2_2            (*(volatile unsigned long *)(IOCON_BASE + 0x05C))

#define IOCON_PIO0_8            (*(volatile unsigned long *)(IOCON_BASE + 0x060))
#define IOCON_PIO0_9            (*(volatile unsigned long *)(IOCON_BASE + 0x064))
#define IOCON_JTAG_TCK_PIO0_10  (*(volatile unsigned long *)(IOCON_BASE + 0x068))
#define IOCON_PIO1_10           (*(volatile unsigned long *)(IOCON_BASE + 0x06C))
#define IOCON_PIO2_11           (*(volatile unsigned long *)(IOCON_BASE + 0x070))
#define IOCON_JTAG_TDI_PIO0_11  (*(volatile unsigned long *)(IOCON_BASE + 0x074))
#define IOCON_JTAG_TMS_PIO1_0   (*(volatile unsigned long *)(IOCON_BASE + 0x078))
#define IOCON_JTAG_TDO_PIO1_1   (*(volatile unsigned long *)(IOCON_BASE + 0x07C))

#define IOCON_JTAG_nTRST_PIO1_2 (*(volatile unsigned long *)(IOCON_BASE + 0x080))
#define IOCON_PIO3_0            (*(volatile unsigned long *)(IOCON_BASE + 0x084))
#define IOCON_PIO3_1            (*(volatile unsigned long *)(IOCON_BASE + 0x088))
#define IOCON_PIO2_3            (*(volatile unsigned long *)(IOCON_BASE + 0x08C))
#define IOCON_ARM_SWDIO_PIO1_3  (*(volatile unsigned long *)(IOCON_BASE + 0x090))
#define IOCON_PIO1_4            (*(volatile unsigned long *)(IOCON_BASE + 0x094))
#define IOCON_PIO1_11           (*(volatile unsigned long *)(IOCON_BASE + 0x098))
#define IOCON_PIO3_2            (*(volatile unsigned long *)(IOCON_BASE + 0x09C))

#define IOCON_PIO1_5            (*(volatile unsigned long *)(IOCON_BASE + 0x0A0))
#define IOCON_PIO1_6            (*(volatile unsigned long *)(IOCON_BASE + 0x0A4))
#define IOCON_PIO1_7            (*(volatile unsigned long *)(IOCON_BASE + 0x0A8))
#define IOCON_PIO3_3            (*(volatile unsigned long *)(IOCON_BASE + 0x0AC))

#define IOCON_SCKLOC            (*(volatile unsigned long *)(IOCON_BASE + 0x110))

