pangfudong/i.mx53/mcu/ZY_CODE/Startup/lpc1100.h
/*********************************************************************************************************
  ICON_PIO
*********************************************************************************************************/
#define IOCON_PIO0_0            (*(volatile unsigned long *)(IOCON_BASE + 0x00C))
#define IOCON_PIO0_1            (*(volatile unsigned long *)(IOCON_BASE + 0x010))
#define IOCON_PIO0_2            (*(volatile unsigned long *)(IOCON_BASE + 0x01C))
#define IOCON_PIO0_3            (*(volatile unsigned long *)(IOCON_BASE + 0x02C))
#define IOCON_PIO0_4            (*(volatile unsigned long *)(IOCON_BASE + 0x030))
#define IOCON_PIO0_5            (*(volatile unsigned long *)(IOCON_BASE + 0x034))
#define IOCON_PIO0_6            (*(volatile unsigned long *)(IOCON_BASE + 0x04C))
#define IOCON_PIO0_7            (*(volatile unsigned long *)(IOCON_BASE + 0x050))
#define IOCON_PIO0_8            (*(volatile unsigned long *)(IOCON_BASE + 0x060))
#define IOCON_PIO0_9            (*(volatile unsigned long *)(IOCON_BASE + 0x064))
#define IOCON_PIO0_10           (*(volatile unsigned long *)(IOCON_BASE + 0x068))
#define IOCON_PIO0_11           (*(volatile unsigned long *)(IOCON_BASE + 0x074))

#define IOCON_PIO1_0            (*(volatile unsigned long *)(IOCON_BASE + 0x078))
#define IOCON_PIO1_1            (*(volatile unsigned long *)(IOCON_BASE + 0x07C))
#define IOCON_PIO1_2            (*(volatile unsigned long *)(IOCON_BASE + 0x080))
#define IOCON_PIO1_3            (*(volatile unsigned long *)(IOCON_BASE + 0x090))
#define IOCON_PIO1_4            (*(volatile unsigned long *)(IOCON_BASE + 0x094))
#define IOCON_PIO1_5            (*(volatile unsigned long *)(IOCON_BASE + 0x0A0))
#define IOCON_PIO1_6            (*(volatile unsigned long *)(IOCON_BASE + 0x0A4))
#define IOCON_PIO1_7            (*(volatile unsigned long *)(IOCON_BASE + 0x0A8))
#define IOCON_PIO1_8            (*(volatile unsigned long *)(IOCON_BASE + 0x014))
#define IOCON_PIO1_9            (*(volatile unsigned long *)(IOCON_BASE + 0x038))
#define IOCON_PIO1_10           (*(volatile unsigned long *)(IOCON_BASE + 0x06C))
#define IOCON_PIO1_11           (*(volatile unsigned long *)(IOCON_BASE + 0x098))

#define IOCON_PIO2_0            (*(volatile unsigned long *)(IOCON_BASE + 0x008))
#define IOCON_PIO2_1            (*(volatile unsigned long *)(IOCON_BASE + 0x028))
#define IOCON_PIO2_2            (*(volatile unsigned long *)(IOCON_BASE + 0x05C))
#define IOCON_PIO2_3            (*(volatile unsigned long *)(IOCON_BASE + 0x08C))
#define IOCON_PIO2_4            (*(volatile unsigned long *)(IOCON_BASE + 0x040))
#define IOCON_PIO2_5            (*(volatile unsigned long *)(IOCON_BASE + 0x044))
#define IOCON_PIO2_6            (*(volatile unsigned long *)(IOCON_BASE + 0x000))
#define IOCON_PIO2_7            (*(volatile unsigned long *)(IOCON_BASE + 0x020))
#define IOCON_PIO2_8            (*(volatile unsigned long *)(IOCON_BASE + 0x024))
#define IOCON_PIO2_9            (*(volatile unsigned long *)(IOCON_BASE + 0x054))
#define IOCON_PIO2_10           (*(volatile unsigned long *)(IOCON_BASE + 0x058))
#define IOCON_PIO2_11           (*(volatile unsigned long *)(IOCON_BASE + 0x070))

#define IOCON_PIO3_0            (*(volatile unsigned long *)(IOCON_BASE + 0x084))
#define IOCON_PIO3_1            (*(volatile unsigned long *)(IOCON_BASE + 0x088))
#define IOCON_PIO3_2            (*(volatile unsigned long *)(IOCON_BASE + 0x09C))
#define IOCON_PIO3_3            (*(volatile unsigned long *)(IOCON_BASE + 0x0AC))
#define IOCON_PIO3_4            (*(volatile unsigned long *)(IOCON_BASE + 0x03C))
#define IOCON_PIO3_5            (*(volatile unsigned long *)(IOCON_BASE + 0x048))

/*********************************************************************************************************
  System Control
*********************************************************************************************************/
#define SYSCON_BASE             (APB0_BASE + 0x48000)

#define SYSMEMREMAP             (*(volatile unsigned long *)(SYSCON_BASE + 0x000))
#define PRESETCTRL              (*(volatile unsigned long *)(SYSCON_BASE + 0x004))
#define SYSPLLCTRL              (*(volatile unsigned long *)(SYSCON_BASE + 0x008))
#define SYSPLLSTAT              (*(volatile unsigned long *)(SYSCON_BASE + 0x00C))
#define USBPLLCTRL              (*(volatile unsigned long *)(SYSCON_BASE + 0x010))
#define USBPLLSTAT              (*(volatile unsigned long *)(SYSCON_BASE + 0x014))
#define SYSOSCCTRL              (*(volatile unsigned long *)(SYSCON_BASE + 0x020))
#define WDTOSCCTRL              (*(volatile unsigned long *)(SYSCON_BASE + 0x024))
#define IRCCTRL                 (*(volatile unsigned long *)(SYSCON_BASE + 0x028))
#define SYSRESSTAT              (*(volatile unsigned long *)(SYSCON_BASE + 0x030))
#define SYSPLLCLKSEL            (*(volatile unsigned long *)(SYSCON_BASE + 0x040))
#define SYSPLLCLKUEN            (*(volatile unsigned long *)(SYSCON_BASE + 0x044))
#define USBPLLCLKSEL            (*(volatile unsigned long *)(SYSCON_BASE + 0x048))
#define USBPLLCLKUEN            (*(volatile unsigned long *)(SYSCON_BASE + 0x04C))
#define MAINCLKSEL              (*(volatile unsigned long *)(SYSCON_BASE + 0x070))
#define MAINCLKUEN              (*(volatile unsigned long *)(SYSCON_BASE + 0x074))
#define SYSAHBCLKDIV            (*(volatile unsigned long *)(SYSCON_BASE + 0x078))
#define SYSAHBCLKCTRL           (*(volatile unsigned long *)(SYSCON_BASE + 0x080))
#define SSP0CLKDIV              (*(volatile unsigned long *)(SYSCON_BASE + 0x094))
#define UARTCLKDIV              (*(volatile unsigned long *)(SYSCON_BASE + 0x098))
#define SSP1CLKDIV              (*(volatile unsigned long *)(SYSCON_BASE + 0x09C))
#define SYSTICKCLKDIV           (*(volatile unsigned long *)(SYSCON_BASE + 0x0B0))
#define USBCLKSEL               (*(volatile unsigned long *)(SYSCON_BASE + 0x0C0))
#define USBCLKUEN               (*(volatile unsigned long *)(SYSCON_BASE + 0x0C4))
#define USBCLKDIV               (*(volatile unsigned long *)(SYSCON_BASE + 0x0C8))
#define WDTCLKSEL               (*(volatile unsigned long *)(SYSCON_BASE + 0x0D0))
#define WDTCLKUEN               (*(volatile unsigned long *)(SYSCON_BASE + 0x0D4))
#define WDTCLKDIV               (*(volatile unsigned long *)(SYSCON_BASE + 0x0D8))
#define CLKOUTCLKSEL            (*(volatile unsigned long *)(SYSCON_BASE + 0x0E0))
#define CLKOUTUEN               (*(volatile unsigned long *)(SYSCON_BASE + 0x0E4))
#define CLKOUTDIV               (*(volatile unsigned long *)(SYSCON_BASE + 0x0E8))
#define PIOPORCAP0              (*(volatile unsigned long *)(SYSCON_BASE + 0x100))
#define PIOPORCAP1              (*(volatile unsigned long *)(SYSCON_BASE + 0x104))
#define BODCTRL                 (*(volatile unsigned long *)(SYSCON_BASE + 0x150))
#define SYSTCKCAL               (*(volatile unsigned long *)(SYSCON_BASE + 0x158))
#define STARTAPRP0              (*(volatile unsigned long *)(SYSCON_BASE + 0x200))
#define STARTERP0               (*(volatile unsigned long *)(SYSCON_BASE + 0x204))
#define STARTRSRP0CLR           (*(volatile unsigned long *)(SYSCON_BASE + 0x208))
#define STARTSRP0               (*(volatile unsigned long *)(SYSCON_BASE + 0x20C))
#define STARTAPRP1              (*(volatile unsigned long *)(SYSCON_BASE + 0x210))
#define STARTERP1               (*(volatile unsigned long *)(SYSCON_BASE + 0x214))
#define STARTRSRP1CLR           (*(volatile unsigned long *)(SYSCON_BASE + 0x218))
#define STARTSRP1               (*(volatile unsigned long *)(SYSCON_BASE + 0x21C))
#define PDSLEEPCFG              (*(volatile unsigned long *)(SYSCON_BASE + 0x230))
#define PDAWAKECFG              (*(volatile unsigned long *)(SYSCON_BASE + 0x234))
#define PDRUNCFG                (*(volatile unsigned long *)(SYSCON_BASE + 0x238))
#define DEVICE_ID               (*(volatile unsigned long *)(SYSCON_BASE + 0x3F4))

