pangfudong/i.mx53/mcu/ZY_CODE/Startup/lpc1100.h
/*********************************************************************************************************
  AHB peripherals
*********************************************************************************************************/
#define GPIO_BASE               (AHB_BASE  + 0x00000)
#define GPIO0DATA               (*(volatile unsigned long *)(GPIO_BASE + 0x00000 + 0x3FFC))
#define GPIO0MASKED_ACCESS(bit) (*(volatile unsigned long *)(GPIO_BASE + 0x00000 + (bit)))
#define GPIO1DATA               (*(volatile unsigned long *)(GPIO_BASE + 0x10000 + 0x3FFC))
#define GPIO1MASKED_ACCESS(bit) (*(volatile unsigned long *)(GPIO_BASE + 0x10000 + (bit)))
#define GPIO2DATA               (*(volatile unsigned long *)(GPIO_BASE + 0x20000 + 0x3FFC))
#define GPIO2MASKED_ACCESS(bit) (*(volatile unsigned long *)(GPIO_BASE + 0x20000 + (bit)))
#define GPIO3DATA               (*(volatile unsigned long *)(GPIO_BASE + 0x30000 + 0x3FFC))
#define GPIO3MASKED_ACCESS(bit) (*(volatile unsigned long *)(GPIO_BASE + 0x30000 + (bit)))

#define GPIO0_BASE              (AHB_BASE  + 0x00000)
#define GPIO0DIR                (*(volatile unsigned long *)(GPIO0_BASE + 0x8000))
#define GPIO0IS                 (*(volatile unsigned long *)(GPIO0_BASE + 0x8004))
#define GPIO0IBE                (*(volatile unsigned long *)(GPIO0_BASE + 0x8008))
#define GPIO0IEV                (*(volatile unsigned long *)(GPIO0_BASE + 0x800C))
#define GPIO0IE                 (*(volatile unsigned long *)(GPIO0_BASE + 0x8010))
#define GPIO0RIS                (*(volatile unsigned long *)(GPIO0_BASE + 0x8014))
#define GPIO0MIS                (*(volatile unsigned long *)(GPIO0_BASE + 0x8018))
#define GPIO0IC                 (*(volatile unsigned long *)(GPIO0_BASE + 0x801C))

#define GPIO1_BASE              (AHB_BASE  + 0x10000)
#define GPIO1DIR                (*(volatile unsigned long *)(GPIO1_BASE + 0x8000))
#define GPIO1IS                 (*(volatile unsigned long *)(GPIO1_BASE + 0x8004))
#define GPIO1IBE                (*(volatile unsigned long *)(GPIO1_BASE + 0x8008))
#define GPIO1IEV                (*(volatile unsigned long *)(GPIO1_BASE + 0x800C))
#define GPIO1IE                 (*(volatile unsigned long *)(GPIO1_BASE + 0x8010))
#define GPIO1RIS                (*(volatile unsigned long *)(GPIO1_BASE + 0x8014))
#define GPIO1MIS                (*(volatile unsigned long *)(GPIO1_BASE + 0x8018))
#define GPIO1IC                 (*(volatile unsigned long *)(GPIO1_BASE + 0x801C))

#define GPIO2_BASE              (AHB_BASE  + 0x20000)
#define GPIO2DIR                (*(volatile unsigned long *)(GPIO2_BASE + 0x8000))
#define GPIO2IS                 (*(volatile unsigned long *)(GPIO2_BASE + 0x8004))
#define GPIO2IBE                (*(volatile unsigned long *)(GPIO2_BASE + 0x8008))
#define GPIO2IEV                (*(volatile unsigned long *)(GPIO2_BASE + 0x800C))
#define GPIO2IE                 (*(volatile unsigned long *)(GPIO2_BASE + 0x8010))
#define GPIO2RIS                (*(volatile unsigned long *)(GPIO2_BASE + 0x8014))
#define GPIO2MIS                (*(volatile unsigned long *)(GPIO2_BASE + 0x8018))
#define GPIO2IC                 (*(volatile unsigned long *)(GPIO2_BASE + 0x801C))

#define GPIO3_BASE              (AHB_BASE  + 0x30000)
#define GPIO3DIR                (*(volatile unsigned long *)(GPIO3_BASE + 0x8000))
#define GPIO3IS                 (*(volatile unsigned long *)(GPIO3_BASE + 0x8004))
#define GPIO3IBE                (*(volatile unsigned long *)(GPIO3_BASE + 0x8008))
#define GPIO3IEV                (*(volatile unsigned long *)(GPIO3_BASE + 0x800C))
#define GPIO3IE                 (*(volatile unsigned long *)(GPIO3_BASE + 0x8010))
#define GPIO3RIS                (*(volatile unsigned long *)(GPIO3_BASE + 0x8014))
#define GPIO3MIS                (*(volatile unsigned long *)(GPIO3_BASE + 0x8018))
#define GPIO3IC                 (*(volatile unsigned long *)(GPIO3_BASE + 0x801C))

#define ST_BASE                 (0xE000E000+ 0x0010)
#define SYSTICKCTRL             (*(volatile unsigned long *)(SYSTICK_BASE + 0x0000))
#define SYSTICKLOAD             (*(volatile unsigned long *)(SYSTICK_BASE + 0x0004))
#define SYSTICKVAL              (*(volatile unsigned long *)(SYSTICK_BASE + 0x0008))
#define SYSTICKCALIB            (*(volatile unsigned long *)(SYSTICK_BASE + 0x000C))

/*********************************************************************************************************
  NVIC Interrupt channels  NVIC中断控制通道号
*********************************************************************************************************/
#define MAIN_STACK              0                                       /*  Main Stack                  */
#define RESETI                  1                                       /*  Reset                       */
#define NMII                    2                                       /*  Non-maskable Interrupt      */
#define HFI                     3                                       /*  Hard Fault                  */
#define MMI                     4                                       /*  Memory Management           */
#define BFI                     5                                       /*  Bus Fault                   */
#define UFI                     6                                       /*  Usage Fault                 */
#define SVCI                    11                                      /*  SVCall                      */
#define DMI                     12                                      /*  Debug Monitor               */
#define PSI                     14                                      /*  PendSV                      */
#define STI                     15                                      /*  SysTick                     */
#define WAKEUP_PIO0_0           16                                      /*  PI0_0 Interup wake-up       */
#define WAKEUP_PIO0_1           17                                      /*  PI0_1 Interup wake-up       */
#define WAKEUP_PIO0_2           18                                      /*  PI0_2 Interup wake-up       */
#define WAKEUP_PIO0_3           19                                      /*  PI0_3 Interup wake-up       */
#define WAKEUP_PIO0_4           20                                      /*  PI0_4 Interup wake-up       */
#define WAKEUP_PIO0_5           21                                      /*  PI0_5 Interup wake-up       */
#define WAKEUP_PIO0_6           22                                      /*  PI0_6 Interup wake-up       */
#define WAKEUP_PIO0_7           23                                      /*  PI0_7 Interup wake-up       */
#define WAKEUP_PIO0_8           24                                      /*  PI0_8 Interup wake-up       */
#define WAKEUP_PIO0_9           25                                      /*  PI0_9 Interup wake-up       */
#define WAKEUP_PIO0_10          26                                      /*  PI0_10 Interup wake-up      */
#define WAKEUP_PIO0_11          27                                      /*  PI0_11 Interup wake-up      */
#define WAKEUP_PIO1_0           28                                      /*  PI1_0 Interup wake-up       */
#define NVIC_SSP1               30                                      /*  TxFIFO half Empty RxFIFO    */
#define NVIC_I2C                31                                      /*  SI State Change             */
#define NVIC_TIMER16B0          32                                      /*  Match0-x caputre0-x         */
#define NVIC_TIMER16B1          33                                      /*  Match0-x capture0-x         */
#define NVIC_TIMER32B0          34                                      /*  Match0-x capture0-x         */
#define NVIC_TIMER32B1          35                                      /*  Match0-x capture0-x         */
#define NVIC_SSP0               36                                      /*  TxFIFO half Empty RxFIFO    */
#define NVIC_UART               37                                      /*  RLS,THRE,RDA,CTI,ABEO,ABTO  */
#define NVIC_ADC                40                                      /*  ADC                         */
#define NVIC_WDT                41                                      /*  WDTINT                      */
#define NVIC_BOD                42                                      /*  Brown-out detect            */
#define NVIC_PIOINT3            44                                      /*  GPIO3 Interrupt Status      */
#define NVIC_PIOINT2            45                                      /*  GPIO2 Interrupt Status      */
#define NVIC_PIOINT1            46                                      /*  GPIO1 Interrupt Status      */
#define NVIC_PIOINT0            47                                      /*  GPIO0 Interrupt Status      */
                                                                        
/*********************************************************************************************************
  NVIC Interrupt Priority   NVIC中断优先级
*********************************************************************************************************/
#define PRIO_ZERO               (0x00)                                  /*  优先级为0                   */
#define PRIO_ONE                (0x01ul << 6)                           /*  优先级为1                   */
#define PRIO_TWO                (0x02ul << 6)                           /*  优先级为2                   */
#define PRIO_THREE              (0x03ul << 6)                           /*  优先级为3                   */

#endif                                                                  /*  __IOLPC1100_H               */
/*********************************************************************************************************
  End Of File
*********************************************************************************************************/

